sex = ["мужской", "женский"]

blood_group = ["Первая", "Вторая", "Третья", "Четвёртая"]

rh_factor = ["Отрицательная (-)", "Положительная (+)"]

email_domains = ["mail.ru", "gmail.com", "yandex.ru", "rambler.ru", "bk.ru", "list.ru", "inbox.ru"]

house_types = ["д.", "дом", "строение"]

card_types = ["Visa", "MasterCard", "Мир"]

educations = [
    "Среднее",
    "Среднее специальное",
    "Высшее",
    "Неоконченное высшее",
    "Бакалавриат",
    "Магистратура",
    "Аспирантура",
    "Кандидат наук",
    "Доктор наук",
    "Начальное",
    "Основное общее",
    "Среднее общее",
    "Среднее профессиональное"
]

driver_license_category = [
    "B1", "B", "M",
    "A", "A1", "C", "C1", "D", "D1", "E",
    "BE", "CE", "C1E", "DE", "D1E", "Tm", "Tb",
    "A2", "C1E", "D1E", "M", "AM", "L", "T"
]

alphabet = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
            'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

russian_alphabet = [
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й',
    'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф',
    'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я'
]

region_codes = [
    '01', '02', '102', '702', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '113', '14', '15', '16', '116', '716',
    '17', '18', '19', '21', '121', '22', '122', '23', '93', '123', '193', '24', '84', '88', '124', '25', '125', '26', '126', '27', '28',
    '29', '30', '31', '32', '33', '34', '134', '35', '36', '136', '37', '38', '138', '39', '91', '40', '41', '42', '142', '43', '44',
    '45', '46', '47', '147', '48', '49', '50', '90', '150', '190', '750', '51', '52', '152', '53', '54', '154', '55', '56', '57', '58',
    '59', '81', '159', '60', '61', '161', '62', '63', '163', '64', '164', '65', '66', '96', '196', '67', '68', '69', '70', '71', '72',
    '73', '173', '74', '174', '75', '80', '76', '77', '97', '99', '177', '197', '199', '777', '797', '799', '78', '98', '178', '198',
    '79', '82', '83', '86', '186', '87', '89', '92', '94', '95'
]

eye_color = ["карий", "чёрный", "голубой", "синий", "серый", "зелёный",
             "янтарный", "жёлтый", "фиолетовый", "красный", "гетерохромия"]

hair_colors = [
    "чёрный","каштановый","русый","рыжий",
    "блондин","шатен","седой","пепельный",
    "медовый","золотистый","красное дерево",
    "медный","пшеничный","песочный","коричневый",
    "тёмно-русый","светло-русый","тёмно-каштановый",
    "светло-каштановый","бронзовый","рыжеватый",
    "с проседью","крашеный","натуральный"
]